Repository: easydev991/SwiftUI-WorkoutApp
Catalog: SwiftUI-WorkoutApp/Libraries/SWNetwork/Sources/SWNetwork/Internal/Localizable.xcstrings
Source language: en
Languages: ru

# Error.BadRequest
source: The request contains an error
ru: Запрос содержит ошибку

# Error.Decoding
source: Failed to decode server response
ru: Не удалось декодировать ответ

# Error.InvalidCredentials
source: Invalid username or password
ru: Некорректное имя пользователя или пароль

# Error.InvalidUserID
source: Invalid user ID
ru: Некорректный идентификатор пользователя

# Error.NoData
source: The server did not send data to process the response
ru: Сервер не прислал данные для обработки ответа

# Error.NoInternet
source: No network connection
ru: Нет соединения с сетью

# Error.NotFound
source: The requested resource is not found
ru: Запрашиваемый ресурс не найден

# Error.PayloadTooLarge
source: The amount of data to upload to the server exceeds the limit
ru: Объем данных для загрузки на сервер превышает лимит

# Error.ServerError
source: Internal Server Error
ru: Внутренняя ошибка сервера

# Error.Unknown
source: Unknown error
ru: Неизвестная ошибка
